Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType
Since:
2012
Analytical surface types.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.Underground
Underground

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.Air
Air.

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.Shading
Shading.

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.ExteriorFloor
Exterior floor.

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.InteriorFloor
Interior floor.

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.Ceiling
Ceiling.

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.InteriorWall
Interior wall.

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.ExteriorWall
Exterior wall.

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType.Roof
Roof.